package com.billylu.android.utildemo.bean.mob;

import java.util.List;

/**
 * Created by maning on 2017/5/12.
 */

public class MobHealthEntity {


    /**
     * list : [{"content":"　　健康的肌体必须保持水分的平衡，人在一天中应该饮用7-8杯水。\u201c一日之计在于晨\u201d，清晨的第一杯水尤其显得重要。也许你已习惯了早上起床后喝一杯水，但你是否审视过，这一杯水到底该怎么喝? 　　1、喝什么? 　　新鲜的白开水是最佳选择。白开水是天然状态的水经过多层净化处理后煮沸而来，水中的微生物已经在高温中被杀死，而开水中的钙、镁元素对身体健康是很有益的。有研究表明，含钙、镁等元素的硬水有预防心血管疾病的作用。 　　有不少人认为喝淡盐水有利于身体健康，于是晨起就喝淡盐水，这种认识却是错误的。研究认为，人在整夜睡眠中未饮滴水，然而呼吸、排汗、泌尿却仍在进行中，这些生理活动要消耗损失许多水分。 　　早晨起床如饮些白开水，可很快使血液得到稀释，纠正夜间的高渗性脱水。而喝盐水则反而会加重高渗性脱水，令人更加口干。何况，早晨是人体血压升高的第一个高峰，喝盐水会使血压更高。 　　早上起来的第一杯水最好不要喝果汁、可乐、汽水、咖啡、牛奶等饮料。汽水和可乐等碳酸饮料中大都含有柠檬酸，在代谢中会加速钙的排泄，降低血液中钙的含量，长期饮用会导致缺钙。而另一些饮料有利尿作用，清晨饮用非但不能有效补充肌体缺少的水分，还会增加肌体对水的需求，反而造成体内缺水。 　　2、什么温度最适宜? 　　有的人喜欢早上起床以后喝冰箱里的冰水，觉得这样最提神。其实，早上喝这样的水是不合时宜的，因为此时胃肠都已排空，过冷或过烫的水都会刺激到肠胃，引起肠胃不适。 　　晨起喝水，喝与室温相同的开水最佳，天冷时可喝温开水，以尽量减少对胃肠的刺激。研究发现，煮沸后冷却至20-25的白开水，具有特异的生物活性，它比较容易透过细胞膜，并能促进新陈代谢，增强人体的免疫功能。凡是习惯喝温、凉开水的人，体内脱氧酶的活性较高，新陈代谢状态好，肌肉组织中的乳酸积累减少，不易感到疲劳。在头天晚上晾开水时一定要加盖，因为开水在空气中暴露太久会失去活性。 　　3、喝多少? 　　一个健康的人每天至少要喝7~8杯水(约2.5升)，运动量大或天气炎热时，饮水量就要相应增多。清晨起床时是新的一天身体补充水分的关键时刻，此时喝300毫升的水最佳。 　　4、怎么喝? 　　清晨喝水必须是空腹喝，也就是在吃早餐之前喝水，否则就收不到促进血液循环、冲刷肠胃等效果。最好小口小口地喝水，因为饮水速度过猛对身体是非常不利的，可能引起血压降低和脑水肿，导致头痛、恶心、呕吐。","id":799,"title":"每天第一杯水怎么喝最美容?"},{"content":"　　脸上干干的，自然不舒服。有什么简单实用的保湿招呢，答案就是矿泉水；春天也是接近夏天的季节，美白也被提上日程了，美白招呢，还是离不了矿泉水，一起来看看吧。 　　一、矿泉水珍珠眼霜 　　珍珠眼霜能有效抗老化,抗自由基,促进眼部血液循环,保湿肌肤,预防皱纹及黑眼圈的产生：  　　制作成本：10元 　　适用各类肤质 　　材料购买地：药店和超市 　　材料：银耳30克,珍珠粉5克,矿泉水少量。 　　功效：润白眼部肌肤,增强眼部肌肤的弹性,消除黑眼圈。 　　使用方法：每次取4滴涂于眼角和眼周,从眉心开始围绕眼睛涂抹。 　　制作方法：  　　1、银耳放入锅中,加入少量的水,小火慢煮至熬成浓汁。 　　2、放入珍珠粉,搅拌均匀,待冷却后装入瓶中放入冰箱内冰冻。 　　保存方法：装入瓶中放入冰箱内冰冻,2周内用完即可。 　　二、矿泉水+海藻粉，创造水晶肌肤 　　海藻粉对粗糙的皮肤十分有效，不仅能供给水分，还能减少刺激，消除炎症，每周做2次，效果非常明显。 　　DIY：面膜 　　1. 将1/3匙海藻粉和1匙甘油，放入矿泉水中搅拌。 　　2. 用化妆绵蘸取后敷在面部。 　　3. 20分钟后，用温水洗净，并涂上面霜。 　　三、压缩纸膜＋矿泉水，保湿大王 　　材料：主要是网购的压缩纸膜和矿泉水 　　做法：将纸膜投入矿泉水中，待纸膜泡开了，敷在脸上三到五分钟即可 　　小提示：网上买的压缩纸膜,最好是每一粒单独包装的，价格贵了一点，但是卫生，这很重要的。 　　体验说明：这样最补水,效果很好,不会有任何副作用,我是敏感肌,也在用这种方法补水。 　　四、白醋＋矿泉水：收缩毛孔又补水 　　1、到超市里买瓶白醋，最贵的也只有三块几一大瓶。 　　2、然后用矿泉水以1：3的比例对起来，晚上洗完脸后扑到脸上，收缩毛孔补水美白。对皮肤没有任何伤害作用。 　　五、矿泉水补水美白超级面膜（时间：1分钟） 　　这是牛尔在《女人我最大》中教给观众的，超级简单实用。 　　原料：  　　压缩面膜一颗、矿泉水一小碗、维生素C适量。我用的是最普通的白色颗粒，100mg的。牛尔在节目中说年纪轻的话只要500mg就够了。 　　做法：  　　只要把维生素C捣碎，倒入矿泉水溶解，然后把准备好的压缩面膜泡在水里面发起来就可以了。 　　修改版：  　　我用的是冰箱里妈妈泡的柠檬水！柠檬里面也有很多维C，也很美白。那么用它代替矿泉水应该会更好吧。 　　效果：  　　完了往镜子里一看，真是吓一跳，白嫩嫩的，皮肤也变得水水的。而且揭下面膜的时候，不知道是不是心理作用，觉得没有敷到的眼睛周围跟旁边的比黑了很多。 　　特别说明的事：  　　这个面膜做好了是要洗干净的，因为维生素C可能没有完全融化，如果残留在脸上的话，对皮肤不好，会变得黄黄的。 　　适得其反哦，所以用完了别忘记洗掉。","id":920,"title":"矿泉水保湿美白五大奇招"}]
     * page : 1
     * total : 445
     */

    private int page;
    private int total;
    private List<ListBean> list;

    public int getPage() {
        return page;
    }

    public void setPage(int page) {
        this.page = page;
    }

    public int getTotal() {
        return total;
    }

    public void setTotal(int total) {
        this.total = total;
    }

    public List<ListBean> getList() {
        return list;
    }

    public void setList(List<ListBean> list) {
        this.list = list;
    }

    public static class ListBean {
        /**
         * content : 　　健康的肌体必须保持水分的平衡，人在一天中应该饮用7-8杯水。“一日之计在于晨”，清晨的第一杯水尤其显得重要。也许你已习惯了早上起床后喝一杯水，但你是否审视过，这一杯水到底该怎么喝? 　　1、喝什么? 　　新鲜的白开水是最佳选择。白开水是天然状态的水经过多层净化处理后煮沸而来，水中的微生物已经在高温中被杀死，而开水中的钙、镁元素对身体健康是很有益的。有研究表明，含钙、镁等元素的硬水有预防心血管疾病的作用。 　　有不少人认为喝淡盐水有利于身体健康，于是晨起就喝淡盐水，这种认识却是错误的。研究认为，人在整夜睡眠中未饮滴水，然而呼吸、排汗、泌尿却仍在进行中，这些生理活动要消耗损失许多水分。 　　早晨起床如饮些白开水，可很快使血液得到稀释，纠正夜间的高渗性脱水。而喝盐水则反而会加重高渗性脱水，令人更加口干。何况，早晨是人体血压升高的第一个高峰，喝盐水会使血压更高。 　　早上起来的第一杯水最好不要喝果汁、可乐、汽水、咖啡、牛奶等饮料。汽水和可乐等碳酸饮料中大都含有柠檬酸，在代谢中会加速钙的排泄，降低血液中钙的含量，长期饮用会导致缺钙。而另一些饮料有利尿作用，清晨饮用非但不能有效补充肌体缺少的水分，还会增加肌体对水的需求，反而造成体内缺水。 　　2、什么温度最适宜? 　　有的人喜欢早上起床以后喝冰箱里的冰水，觉得这样最提神。其实，早上喝这样的水是不合时宜的，因为此时胃肠都已排空，过冷或过烫的水都会刺激到肠胃，引起肠胃不适。 　　晨起喝水，喝与室温相同的开水最佳，天冷时可喝温开水，以尽量减少对胃肠的刺激。研究发现，煮沸后冷却至20-25的白开水，具有特异的生物活性，它比较容易透过细胞膜，并能促进新陈代谢，增强人体的免疫功能。凡是习惯喝温、凉开水的人，体内脱氧酶的活性较高，新陈代谢状态好，肌肉组织中的乳酸积累减少，不易感到疲劳。在头天晚上晾开水时一定要加盖，因为开水在空气中暴露太久会失去活性。 　　3、喝多少? 　　一个健康的人每天至少要喝7~8杯水(约2.5升)，运动量大或天气炎热时，饮水量就要相应增多。清晨起床时是新的一天身体补充水分的关键时刻，此时喝300毫升的水最佳。 　　4、怎么喝? 　　清晨喝水必须是空腹喝，也就是在吃早餐之前喝水，否则就收不到促进血液循环、冲刷肠胃等效果。最好小口小口地喝水，因为饮水速度过猛对身体是非常不利的，可能引起血压降低和脑水肿，导致头痛、恶心、呕吐。
         * id : 799
         * title : 每天第一杯水怎么喝最美容?
         */

        private String content;
        private int id;
        private String title;

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }
    }
}
